hejunlin3678/gd32f4/MDK/app/emmc/emmc.c
/*!
    \file    sdcard.c
    \brief   MMC card driver

    \version 2022-05-26, V2.0.0, demo for GD32F4xx
*/

/*
    Copyright (c) 2022, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "emmc/emmc.h"
#include "gd32f4xx_sdio.h"
#include "gd32f4xx_dma.h"
#include <stddef.h>

/* card status of R1 definitions */
#define MMC_R1_OUT_OF_RANGE                  BIT(31)                   /* command's argument was out of the allowed range */
#define MMC_R1_ADDRESS_ERROR                 BIT(30)                   /* misaligned address which did not match the block length */
#define MMC_R1_BLOCK_LEN_ERROR               BIT(29)                   /* transferred block length is not allowed */
#define MMC_R1_ERASE_SEQ_ERROR               BIT(28)                   /* an error in the sequence of erase commands occurred */
#define MMC_R1_ERASE_PARAM                   BIT(27)                   /* an invalid selection of write-blocks for erase occurred */
#define MMC_R1_WP_VIOLATION                  BIT(26)                   /* the host attempts to write to a protected block or to the temporary or permanent write protected card */
#define MMC_R1_CARD_IS_LOCKED                BIT(25)                   /* the card is locked by the host */
#define MMC_R1_LOCK_UNLOCK_FAILED            BIT(24)                   /* a sequence or password error has been detected in lock/unlock card command */
#define MMC_R1_COM_CRC_ERROR                 BIT(23)                   /* CRC check of the previous command failed */
#define MMC_R1_ILLEGAL_COMMAND               BIT(22)                   /* command not legal for the card state */
#define MMC_R1_CARD_ECC_FAILED               BIT(21)                   /* card internal ECC was applied but failed to correct the data */
#define MMC_R1_CC_ERROR                      BIT(20)                   /* internal card controller error */
#define MMC_R1_GENERAL_UNKNOWN_ERROR         BIT(19)                   /* a general or an unknown error occurred during the operation */
#define MMC_R1_CSD_OVERWRITE                 BIT(16)                   /* read only section of the CSD does not match or attempt to reverse the copy or permanent WP bits */
#define MMC_R1_WP_ERASE_SKIP                 BIT(15)                   /* partial address space was erased */
#define MMC_R1_CARD_ECC_DISABLED             BIT(14)                   /* command has been executed without using the internal ECC */
#define MMC_R1_ERASE_RESET                   BIT(13)                   /* an erase sequence was cleared before executing */
#define MMC_R1_READY_FOR_DATA                BIT(8)                    /* correspond to buffer empty signaling on the bus */
#define MMC_R1_APP_CMD                       BIT(5)                    /* card will expect ACMD */
#define MMC_R1_AKE_SEQ_ERROR                 BIT(3)                    /* error in the sequence of the authentication process */
#define MMC_R1_ERROR_BITS                    (uint32_t)0xFDF9E008      /* all the R1 error bits */

/* card status of R6 definitions */
#define MMC_R6_COM_CRC_ERROR                 BIT(15)                   /* CRC check of the previous command failed */
#define MMC_R6_ILLEGAL_COMMAND               BIT(14)                   /* command not legal for the card state */
#define MMC_R6_GENERAL_UNKNOWN_ERROR         BIT(13)                   /* a general or an unknown error occurred during the operation */

/* card state */
#define MMC_CARDSTATE_IDLE                   ((uint8_t)0x00)           /* card is in idle state */
#define MMC_CARDSTATE_READY                  ((uint8_t)0x01)           /* card is in ready state */
#define MMC_CARDSTATE_IDENTIFICAT            ((uint8_t)0x02)           /* card is in identificat state */
#define MMC_CARDSTATE_STANDBY                ((uint8_t)0x03)           /* card is in standby state */
#define MMC_CARDSTATE_TRANSFER               ((uint8_t)0x04)           /* card is in transfer state */
#define MMC_CARDSTATE_DATA                   ((uint8_t)0x05)           /* card is in data sending state */
#define MMC_CARDSTATE_RECEIVING              ((uint8_t)0x06)           /* card is in receiving state */
#define MMC_CARDSTATE_PROGRAMMING            ((uint8_t)0x07)           /* card is in programming state */
#define MMC_CARDSTATE_DISCONNECT             ((uint8_t)0x08)           /* card is in disconnect state */
#define MMC_CARDSTATE_LOCKED                 ((uint32_t)0x02000000)    /* card is in locked state */

#define MMC_CHECK_PATTERN                    ((uint32_t)0x000001AA)    /* check pattern for CMD8 */
#define MMC_VOLTAGE_WINDOW                   ((uint32_t)0x80100000)    /* host 3.3V request in ACMD41 */

/* parameters for ACMD41(voltage validation) */
#define MMC_HIGH_CAPACITY                    ((uint32_t)0x40000000)    /* high capacity SD memory card */
#define MMC_STD_CAPACITY                     ((uint32_t)0x00000000)    /* standard capacity SD memory card */

/* SD bus width, check SCR register */
#define MMC_BUS_WIDTH_8BIT                   ((uint32_t)0x00140000)    /* 8-bit width bus mode */
#define MMC_BUS_WIDTH_4BIT                   ((uint32_t)0x00040000)    /* 4-bit width bus mode */
#define MMC_BUS_WIDTH_1BIT                   ((uint32_t)0x00010000)    /* 1-bit width bus mode */

/* masks for SCR register */
#define MMC_MASK_0_7BITS                     ((uint32_t)0x000000FF)    /* mask [7:0] bits */
#define MMC_MASK_8_15BITS                    ((uint32_t)0x0000FF00)    /* mask [15:8] bits */
#define MMC_MASK_16_23BITS                   ((uint32_t)0x00FF0000)    /* mask [23:16] bits */
#define MMC_MASK_24_31BITS                   ((uint32_t)0xFF000000)    /* mask [31:24] bits */

#define SDIO_FIFO_ADDR                      ((uint32_t)0x40012C80)    /* address of SDIO_FIFO */
#define MMC_FIFOHALF_WORDS                   ((uint32_t)0x00000008)    /* words of FIFO half full/empty */
#define MMC_FIFOHALF_BYTES                   ((uint32_t)0x00000020)    /* bytes of FIFO half full/empty */

#define MMC_DATATIMEOUT                      ((uint32_t)0xFFFFFFFF)    /* DSM data timeout */
#define MMC_MAX_VOLT_VALIDATION              ((uint32_t)0x0000FFFF)    /* the maximum times of voltage validation */
#define MMC_MAX_DATA_LENGTH                  ((uint32_t)0x01FFFFFF)    /* the maximum length of data */
#define MMC_ALLZERO                          ((uint32_t)0x00000000)    /* all zero */
#define MMC_RCA_SHIFT                        ((uint8_t)0x10)           /* RCA shift bits */
#define MMC_CLK_DIV_INIT                     ((uint16_t)0x0076)        /* SD clock division in initilization phase */
//#define MMC_CLK_DIV_TRANS                    ((uint16_t)0x0002)        /* SD clock division in transmission phase */
#define MMC_CLK_DIV_TRANS                    ((uint16_t)0x0020)        /* SD clock division in transmission phase */
#define MMC_CLK_DIV_TRANS_16M                 ((uint16_t)0x0001)       /* SD clock division in transmission phase */
#define MMC_CLK_DIV_TRANS_24M                 ((uint16_t)0x0000)       /* SD clock division in transmission phase */

