hejunlin3678/gd32f4/MDK/app/emmc/emmc.c
    cardtype = SDIO_EMMC;

    while(timeout--) {
        sdio_command_response_config(MMC_CMD_SEND_OP_COND, (uint32_t)0x40ff8000, SDIO_RESPONSETYPE_SHORT);
        sdio_wait_type_set(SDIO_WAITTYPE_NO);
        /* enable the CSM */
        sdio_csm_enable();


        /* check if some error occurs */
        status = r3_error_check();
        if(MMC_OK != status) {
            return status;
        }
        if(!timeout) {
            status = MMC_ERROR;
            return status;
        }

        /* get the response and check card power up status bit(busy) */
        response = sdio_response_get(SDIO_RESPONSE0);

        if(0x80000000 == (response & 0x80000000)) {
            break;
        } else {
            continue;
        }
    }

    return status;
}

/*!
    \brief      close the power of SDIO
    \param[in]  none
    \param[out] none
    \retval     sd_error_enum
*/
sd_error_enum sd_power_off(void)
{
    sd_error_enum status = MMC_OK;
    sdio_power_state_set(SDIO_POWER_OFF);
    return status;
}

/*!
    \brief      configure the bus mode
    \param[in]  busmode: the bus mode
      \arg        SDIO_BUSMODE_1BIT: 1-bit SDIO card bus mode
      \arg        SDIO_BUSMODE_4BIT: 4-bit SDIO card bus mode
      \arg        SDIO_BUSMODE_8BIT: 8-bit SDIO card bus mode (MMC only)
    \param[out] none
    \retval     sd_error_enum
*/
sd_error_enum sd_bus_mode_config(uint32_t busmode)
{
    sd_error_enum status = MMC_OK;

    if(SDIO_BUSMODE_8BIT == busmode) {
        /* send CMD6(MMC_CMD_SWITCH) to set the width */
        sdio_command_response_config(MMC_CMD_SWITCH_FUNC, (uint32_t)0x03B70200, SDIO_RESPONSETYPE_SHORT);
        sdio_wait_type_set(SDIO_WAITTYPE_NO);
        /* enable the CSM */
        sdio_csm_enable();

        /* check if some error occurs */
        status = r1_error_check(MMC_CMD_SWITCH_FUNC);
        if(MMC_OK != status) {
            return status;
        }

        /* configure SD bus width and the SDIO */
        status = sd_bus_width_config(MMC_BUS_WIDTH_8BIT);
        if(MMC_OK == status) {
            sdio_clock_config(SDIO_SDIOCLKEDGE_RISING, SDIO_CLOCKBYPASS_DISABLE,
                              SDIO_CLOCKPWRSAVE_DISABLE, MMC_CLK_DIV_TRANS_24M);
            sdio_bus_mode_set(busmode);
            sdio_hardware_clock_enable();
        }
    } else if(SDIO_BUSMODE_4BIT == busmode) {
        /* send CMD6(MMC_CMD_SWITCH) to set the width */
        sdio_command_response_config(MMC_CMD_SWITCH_FUNC, (uint32_t)0x03B70100, SDIO_RESPONSETYPE_SHORT);
        sdio_wait_type_set(SDIO_WAITTYPE_NO);
        /* enable the CSM */
        sdio_csm_enable();

        /* check if some error occurs */
        status = r1_error_check(MMC_CMD_SWITCH_FUNC);
        if(MMC_OK != status) {
            return status;
        }
        /* configure SD bus width and the SDIO */
        status = sd_bus_width_config(MMC_BUS_WIDTH_4BIT);
        if(MMC_OK == status) {
            sdio_clock_config(SDIO_SDIOCLKEDGE_RISING, SDIO_CLOCKBYPASS_DISABLE,
                              SDIO_CLOCKPWRSAVE_DISABLE, MMC_CLK_DIV_TRANS_16M);
            sdio_bus_mode_set(busmode);
            sdio_hardware_clock_enable();
        }
    } else if(SDIO_BUSMODE_1BIT == busmode) {
        /* configure SD bus width and the SDIO */
        status = sd_bus_width_config(MMC_BUS_WIDTH_1BIT);
        if(MMC_OK == status) {
            sdio_clock_config(SDIO_SDIOCLKEDGE_RISING, SDIO_CLOCKBYPASS_DISABLE,
                              SDIO_CLOCKPWRSAVE_DISABLE, MMC_CLK_DIV_TRANS_24M);
            sdio_bus_mode_set(busmode);
            sdio_hardware_clock_enable();
        }
    } else {
        status = MMC_PARAMETER_INVALID;
    }

    return status;
}

/*!
    \brief      configure the mode of transmission
    \param[in]  txmode: transfer mode
      \arg        MMC_DMA_MODE: DMA mode
      \arg        MMC_POLLING_MODE: polling mode
    \param[out] none
    \retval     sd_error_enum
*/
sd_error_enum sd_transfer_mode_config(uint32_t txmode)
{
    sd_error_enum status = MMC_OK;
    /* set the transfer mode */
    if((MMC_DMA_MODE == txmode) || (MMC_POLLING_MODE == txmode)) {
        transmode = txmode;
    } else {
        status = MMC_PARAMETER_INVALID;
    }
    return status;
}

/*!
    \brief      read a block data into a buffer from the specified address of a card
    \param[out] preadbuffer: a pointer that store a block read data
    \param[in]  readaddr: the read data address
    \param[in]  blocksize: the data block size
    \retval     sd_error_enum
*/
sd_error_enum sd_block_read(uint32_t *preadbuffer, uint32_t readaddr, uint16_t blocksize)
{
    /* initialize the variables */
    sd_error_enum status = MMC_OK;
    uint32_t count = 0, align = 0, datablksize = SDIO_DATABLOCKSIZE_1BYTE, *ptempbuff = preadbuffer;
    __IO uint32_t timeout = 0;
    uint32_t response = 0;

    if(NULL == preadbuffer) {
        status = MMC_PARAMETER_INVALID;
        return status;
    }

    transerror = MMC_OK;
    transend = 0;
    totalnumber_bytes = 0;
    /* clear all DSM configuration */
    sdio_data_config(0, 0, SDIO_DATABLOCKSIZE_1BYTE);
    sdio_data_transfer_config(SDIO_TRANSDIRECTION_TOCARD, SDIO_TRANSMODE_BLOCK);
    sdio_dsm_disable();
    sdio_dma_disable();

    /* check whether the card is locked */
    if(sdio_response_get(SDIO_RESPONSE0) & MMC_CARDSTATE_LOCKED) {
        status = MMC_LOCK_UNLOCK_FAILED;
        return status;
    }

    readaddr /= blocksize;

    /* send CMD13(SEND_STATUS), addressed card sends its status registers */
    sdio_command_response_config(MMC_CMD_SEND_STATUS, (uint32_t)sd_rca << MMC_RCA_SHIFT, SDIO_RESPONSETYPE_SHORT);
    sdio_wait_type_set(SDIO_WAITTYPE_NO);
    sdio_csm_enable();
    /* check if some error occurs */
    status = r1_error_check(MMC_CMD_SEND_STATUS);
    if(MMC_OK != status) {
        return status;
    }

    response = sdio_response_get(SDIO_RESPONSE0);
    timeout = 100000;
    
    while((0 == (response & MMC_R1_READY_FOR_DATA)) && (timeout > 0)) {
        /* continue to send CMD13 to polling the state of card until buffer empty or timeout */
        --timeout;
        /* send CMD13(SEND_STATUS), addressed card sends its status registers */
        sdio_command_response_config(MMC_CMD_SEND_STATUS, (uint32_t)sd_rca << MMC_RCA_SHIFT, SDIO_RESPONSETYPE_SHORT);
        sdio_wait_type_set(SDIO_WAITTYPE_NO);
        sdio_csm_enable();
        /* check if some error occurs */
        status = r1_error_check(MMC_CMD_SEND_STATUS);
        if(MMC_OK != status) {
            return status;
        }
        response = sdio_response_get(SDIO_RESPONSE0);
    }
    if(0 == timeout) {
        return MMC_ERROR;
    }

    align = blocksize & (blocksize - 1);
    if((blocksize > 0) && (blocksize <= 2048) && (0 == align)) {
        datablksize = sd_datablocksize_get(blocksize);
        /* send CMD16(SET_BLOCKLEN) to set the block length */
        sdio_command_response_config(MMC_CMD_SET_BLOCKLEN, (uint32_t)blocksize, SDIO_RESPONSETYPE_SHORT);
        sdio_wait_type_set(SDIO_WAITTYPE_NO);
        sdio_csm_enable();

        /* check if some error occurs */
        status = r1_error_check(MMC_CMD_SET_BLOCKLEN);
        if(MMC_OK != status) {
            return status;
        }
    } else {
        status = MMC_PARAMETER_INVALID;
        return status;
    }

    stopcondition = 0;
    totalnumber_bytes = blocksize;

    /* configure SDIO data transmisson */
    sdio_data_config(MMC_DATATIMEOUT, totalnumber_bytes, datablksize);
    sdio_data_transfer_config(SDIO_TRANSDIRECTION_TOSDIO, SDIO_TRANSMODE_BLOCK);
    sdio_dsm_enable();

    /* send CMD17(READ_SINGLE_BLOCK) to read a block */
    sdio_command_response_config(MMC_CMD_READ_SINGLE_BLOCK, (uint32_t)readaddr, SDIO_RESPONSETYPE_SHORT);
    sdio_wait_type_set(SDIO_WAITTYPE_NO);
    sdio_csm_enable();
    /* check if some error occurs */
    status = r1_error_check(MMC_CMD_READ_SINGLE_BLOCK);
    if(MMC_OK != status) {
        return status;
    }

    if(MMC_POLLING_MODE == transmode) {
        /* polling mode */
        while(!sdio_flag_get(SDIO_FLAG_DTCRCERR | SDIO_FLAG_DTTMOUT | SDIO_FLAG_RXORE | SDIO_FLAG_DTBLKEND | SDIO_FLAG_STBITE)) {
            if(RESET != sdio_flag_get(SDIO_FLAG_RFH)) {
                /* at least 8 words can be read in the FIFO */
                for(count = 0; count < MMC_FIFOHALF_WORDS; count++) {
                    *(ptempbuff + count) = sdio_data_read();
                    //printf("\n\r %x:  %x \n\r",count,*(ptempbuff + count));
                }
                ptempbuff += MMC_FIFOHALF_WORDS;
            }
        }
//        uint8_t *pdata = (uint8_t *)preadbuffer;

