hejunlin3678/gd32f4/MDK/app/emmc/emmc.c
                }
            }
        }
        
        /* whether some error occurs and return it */
        if(RESET != sdio_flag_get(SDIO_FLAG_DTCRCERR)) {
            status = MMC_DATA_CRC_ERROR;
            sdio_flag_clear(SDIO_FLAG_DTCRCERR);
            return status;
        } else if(RESET != sdio_flag_get(SDIO_FLAG_DTTMOUT)) {
            status = MMC_DATA_TIMEOUT;
            sdio_flag_clear(SDIO_FLAG_DTTMOUT);
            return status;
        } else if(RESET != sdio_flag_get(SDIO_FLAG_TXURE)) {
            status = MMC_TX_UNDERRUN_ERROR;
            sdio_flag_clear(SDIO_FLAG_TXURE);
            return status;
        } else if(RESET != sdio_flag_get(SDIO_FLAG_STBITE)) {
            status = MMC_START_BIT_ERROR;
            sdio_flag_clear(SDIO_FLAG_STBITE);
            return status;
        }
    } else if(MMC_DMA_MODE == transmode) {
        /* DMA mode */
        /* enable the SDIO corresponding interrupts and DMA */
        sdio_interrupt_enable(SDIO_INT_DTCRCERR | SDIO_INT_DTTMOUT | SDIO_INT_TXURE | SDIO_INT_DTEND | SDIO_INT_STBITE);
        dma_transfer_config(pwritebuffer, blocksize);
        sdio_dma_enable();

        timeout = 100000;
        while((RESET == dma_flag_get(DMA1, DMA_CH3, DMA_INTF_FTFIF)) && (timeout > 0)) {
            timeout--;
            if(0 == timeout) {
                return MMC_ERROR;
            }
        }
        while((0 == transend) && (MMC_OK == transerror)) {
        }

        if(MMC_OK != transerror) {
            return transerror;
        }
    } else {
        status = MMC_PARAMETER_INVALID;
        return status;
    }

    /* clear the SDIO_INTC flags */
    sdio_flag_clear(SDIO_MASK_INTC_FLAGS);
    /* get the card state and wait the card is out of programming and receiving state */
    status = sd_card_state_get(&cardstate);
    while((MMC_OK == status) && ((MMC_CARDSTATE_PROGRAMMING == cardstate) || (MMC_CARDSTATE_RECEIVING == cardstate))) {
        status = sd_card_state_get(&cardstate);
    }
    return status;
}

/*!
    \brief      write multiple blocks data to the specified address of a card
    \param[in]  pwritebuffer: a pointer that store multiple blocks data to be transferred
    \param[in]  writeaddr: the read data address
    \param[in]  blocksize: the data block size
    \param[in]  blocksnumber: number of blocks that will be written
    \param[out] none
    \retval     sd_error_enum
*/
sd_error_enum sd_multiblocks_write(uint32_t *pwritebuffer, uint32_t writeaddr, uint16_t blocksize, uint32_t blocksnumber)
{
    /* initialize the variables */
    sd_error_enum status = MMC_OK;
    uint8_t cardstate = 0;
    uint32_t count = 0, align = 0, datablksize = SDIO_DATABLOCKSIZE_1BYTE, *ptempbuff = pwritebuffer;
    uint32_t transbytes = 0, restwords = 0;
    __IO uint32_t timeout = 0;

    if(NULL == pwritebuffer) {
        status = MMC_PARAMETER_INVALID;
        return status;
    }

    transerror = MMC_OK;
    transend = 0;
    totalnumber_bytes = 0;
    /* clear all DSM configuration */
    sdio_data_config(0, 0, SDIO_DATABLOCKSIZE_1BYTE);
    sdio_data_transfer_config(SDIO_TRANSDIRECTION_TOCARD, SDIO_TRANSMODE_BLOCK);
    sdio_dsm_disable();
    sdio_dma_disable();

    /* check whether the card is locked */
    if(sdio_response_get(SDIO_RESPONSE0) & MMC_CARDSTATE_LOCKED) {
        status = MMC_LOCK_UNLOCK_FAILED;
        return status;
    }

    writeaddr /= blocksize;

    align = blocksize & (blocksize - 1);
    if((blocksize > 0) && (blocksize <= 2048) && (0 == align)) {
        datablksize = sd_datablocksize_get(blocksize);
        /* send CMD16(SET_BLOCKLEN) to set the block length */
        sdio_command_response_config(MMC_CMD_SET_BLOCKLEN, (uint32_t)blocksize, SDIO_RESPONSETYPE_SHORT);
        sdio_wait_type_set(SDIO_WAITTYPE_NO);
        sdio_csm_enable();

        /* check if some error occurs */
        status = r1_error_check(MMC_CMD_SET_BLOCKLEN);
        if(MMC_OK != status) {
            return status;
        }
    } else {
        status = MMC_PARAMETER_INVALID;
        return status;
    }


    /* send CMD13(SEND_STATUS), addressed card sends its status registers */
    sdio_command_response_config(MMC_CMD_SEND_STATUS, (uint32_t)sd_rca << MMC_RCA_SHIFT, SDIO_RESPONSETYPE_SHORT);
    sdio_wait_type_set(SDIO_WAITTYPE_NO);
    sdio_csm_enable();
    /* check if some error occurs */
    status = r1_error_check(MMC_CMD_SEND_STATUS);
    if(MMC_OK != status) {
        return status;
    }

    if(blocksnumber > 1) {
        if(blocksnumber * blocksize > MMC_MAX_DATA_LENGTH) {
            status = MMC_PARAMETER_INVALID;
            return status;
        }

        /* send ACMD23(SET_WR_BLK_ERASE_COUNT) to set the number of write blocks to be preerased before writing */
        sdio_command_response_config(MMC_APPCMD_SET_WR_BLK_ERASE_COUNT, blocksnumber, SDIO_RESPONSETYPE_SHORT);
        sdio_wait_type_set(SDIO_WAITTYPE_NO);
        sdio_csm_enable();
        /* check if some error occurs */
        status = r1_error_check(MMC_APPCMD_SET_WR_BLK_ERASE_COUNT);
        if(MMC_OK != status) {
            return status;
        }

        /* send CMD25(WRITE_MULTIPLE_BLOCK) to continuously write blocks of data */
        sdio_command_response_config(MMC_CMD_WRITE_MULTIPLE_BLOCK, writeaddr, SDIO_RESPONSETYPE_SHORT);
        sdio_wait_type_set(SDIO_WAITTYPE_NO);
        sdio_csm_enable();
        /* check if some error occurs */
        status = r1_error_check(MMC_CMD_WRITE_MULTIPLE_BLOCK);
        if(MMC_OK != status) {
            return status;
        }

        stopcondition = 1;
        totalnumber_bytes = blocksnumber * blocksize;

        /* configure the SDIO data transmisson */
        sdio_data_config(MMC_DATATIMEOUT, totalnumber_bytes, datablksize);
        sdio_data_transfer_config(SDIO_TRANSDIRECTION_TOCARD, SDIO_TRANSMODE_BLOCK);
        sdio_dsm_enable();

        if(MMC_POLLING_MODE == transmode) {
            /* polling mode */
            while(!sdio_flag_get(SDIO_FLAG_DTCRCERR | SDIO_FLAG_DTTMOUT | SDIO_FLAG_TXURE | SDIO_FLAG_DTEND | SDIO_FLAG_STBITE)) {
                if(RESET != sdio_flag_get(SDIO_FLAG_TFH)) {
                    /* at least 8 words can be written into the FIFO */
                    if(!((totalnumber_bytes - transbytes) < MMC_FIFOHALF_BYTES)) {
                        for(count = 0; count < MMC_FIFOHALF_WORDS; count++) {
                            sdio_data_write(*(ptempbuff + count));
                        }
                        /* 8 words(32 bytes) has been transferred */
                        ptempbuff += MMC_FIFOHALF_WORDS;
                        transbytes += MMC_FIFOHALF_BYTES;
                    } else {
                        restwords = (totalnumber_bytes - transbytes) / 4 + (((totalnumber_bytes - transbytes) % 4 == 0) ? 0 : 1);
                        for(count = 0; count < restwords; count++) {
                            sdio_data_write(*ptempbuff);
                            ++ptempbuff;
                            transbytes += 4;
                        }
                    }
                }
            }

