hejunlin3678/gd32f4/MDK/app/emmc/emmc.c
        /* capacity = (c_size+1)*512KByte */
        capacity = (devicesize + 1) * 512 * 1024;
    } else if (SDIO_EMMC == cardtype)
    {
        // tempbyte = (uint8_t)(sd_csd[1] >> 30);
        // devicesize = (uint8_t)( (sd_csd[1] & 0x3FF) << 2);
        // devicesize |= tempbyte;
        // printf("devicesize=222[%d]\r\n", devicesize);
        capacity = 2 * 512 * 1024;
    }

    return capacity;
}

/*!
    \brief      get the detailed information of the SD card based on received CID and CSD
    \param[in]  none
    \param[out] pcardinfo: a pointer that store the detailed card information
    \retval     sd_error_enum
*/
sd_error_enum sd_card_information_get(sd_card_info_struct *pcardinfo)
{
    sd_error_enum status = MMC_OK;
    uint8_t tempbyte = 0;

    if(NULL == pcardinfo) {
        status = MMC_PARAMETER_INVALID;
        return status;
    }

    /* store the card type and RCA */
    pcardinfo->card_type = cardtype;
    pcardinfo->card_rca = sd_rca;

    /* CID byte 0 */
    tempbyte = (uint8_t)((sd_cid[0] & MMC_MASK_24_31BITS) >> 24);
    pcardinfo->card_cid.mid = tempbyte;

    /* CID byte 1 */
    tempbyte = (uint8_t)((sd_cid[0] & MMC_MASK_16_23BITS) >> 16);
    pcardinfo->card_cid.cbx = tempbyte & 0x03;

    /* CID byte 2 */
    tempbyte = (uint8_t)((sd_cid[0] & MMC_MASK_8_15BITS) >> 8);
    pcardinfo->card_cid.oid = (uint16_t)tempbyte;

    /* CID byte 3 */
    tempbyte = (uint8_t)(sd_cid[0] & MMC_MASK_0_7BITS);
    pcardinfo->card_cid.pnm0 = (uint32_t)((uint32_t)tempbyte << 24);

    /* CID byte 4 */
    tempbyte = (uint8_t)((sd_cid[1] & MMC_MASK_24_31BITS) >> 24);
    pcardinfo->card_cid.pnm0 |= (uint32_t)((uint32_t)tempbyte << 16);

    /* CID byte 5 */
    tempbyte = (uint8_t)((sd_cid[1] & MMC_MASK_16_23BITS) >> 16);
    pcardinfo->card_cid.pnm0 |= (uint32_t)((uint32_t)tempbyte << 8);

    /* CID byte 6 */
    tempbyte = (uint8_t)((sd_cid[1] & MMC_MASK_8_15BITS) >> 8);
    pcardinfo->card_cid.pnm0 |= (uint32_t)(tempbyte);

    /* CID byte 7 */
    tempbyte = (uint8_t)(sd_cid[1] & MMC_MASK_0_7BITS);
    pcardinfo->card_cid.pnm1 = (uint16_t)((uint16_t)tempbyte << 8);

    /* CID byte 8 */
    tempbyte = (uint8_t)((sd_cid[2] & MMC_MASK_24_31BITS) >> 24);
    pcardinfo->card_cid.pnm1 |= (uint16_t)(tempbyte);

    /* CID byte 9 */
    tempbyte = (uint8_t)((sd_cid[2] & MMC_MASK_16_23BITS) >> 16);
    pcardinfo->card_cid.prv = tempbyte;

    /* CID byte 10 */
    tempbyte = (uint8_t)((sd_cid[2] & MMC_MASK_8_15BITS) >> 8);
    pcardinfo->card_cid.psn = (uint32_t)((uint32_t)tempbyte << 24);


    /* CID byte 11 */
    tempbyte = (uint8_t)(sd_cid[2] & MMC_MASK_0_7BITS);
    pcardinfo->card_cid.psn |= (uint32_t)((uint32_t)tempbyte << 16);

    /* CID byte 12 */
    tempbyte = (uint8_t)((sd_cid[3] & MMC_MASK_24_31BITS) >> 24);
    pcardinfo->card_cid.psn |= (uint32_t)((uint32_t)tempbyte << 8);

    /* CID byte 13 */
    tempbyte = (uint8_t)((sd_cid[3] & MMC_MASK_16_23BITS) >> 16);
    pcardinfo->card_cid.psn |= (uint32_t)tempbyte;

    /* CID byte 14 */
    tempbyte = (uint8_t)((sd_cid[3] & MMC_MASK_8_15BITS) >> 8);
    pcardinfo->card_cid.mdt = (uint16_t)tempbyte;

    /* CID byte 15 */
    tempbyte = (uint8_t)(sd_cid[3] & MMC_MASK_0_7BITS);
    pcardinfo->card_cid.cid_crc = (tempbyte & 0xFE) >> 1;

    /* CSD byte 0 */
    tempbyte = (uint8_t)((sd_csd[0] & MMC_MASK_24_31BITS) >> 24);
    pcardinfo->card_csd.csd_struct = (tempbyte & 0xC0) >> 6;
    pcardinfo->card_csd.spec_vers = (tempbyte & 0x3C) >> 2;

    /* CSD byte 1 */
    tempbyte = (uint8_t)((sd_csd[0] & MMC_MASK_16_23BITS) >> 16);
    pcardinfo->card_csd.taac = tempbyte;

    /* CSD byte 2 */
    tempbyte = (uint8_t)((sd_csd[0] & MMC_MASK_8_15BITS) >> 8);
    pcardinfo->card_csd.nsac = tempbyte;

    /* CSD byte 3 */
    tempbyte = (uint8_t)(sd_csd[0] & MMC_MASK_0_7BITS);
    pcardinfo->card_csd.tran_speed = tempbyte;

    /* CSD byte 4 */
    tempbyte = (uint8_t)((sd_csd[1] & MMC_MASK_24_31BITS) >> 24);
    pcardinfo->card_csd.ccc = (uint16_t)((uint16_t)tempbyte << 4);

    /* CSD byte 5 */
    tempbyte = (uint8_t)((sd_csd[1] & MMC_MASK_16_23BITS) >> 16);
    pcardinfo->card_csd.ccc |= (uint16_t)((uint16_t)(tempbyte & 0xF0) >> 4);
    pcardinfo->card_csd.read_bl_len = tempbyte & 0x0F;

    /* CSD byte 6 */
    tempbyte = (uint8_t)((sd_csd[1] & MMC_MASK_8_15BITS) >> 8);
    pcardinfo->card_csd.read_bl_partial = (tempbyte & 0x80) >> 7;
    pcardinfo->card_csd.write_blk_misalign = (tempbyte & 0x40) >> 6;
    pcardinfo->card_csd.read_blk_misalign = (tempbyte & 0x20) >> 5;
    pcardinfo->card_csd.dsp_imp = (tempbyte & 0x10) >> 4;
    /* card is SDSC card, CSD version 1.0 */
    pcardinfo->card_csd.c_size = (uint32_t)((uint32_t)(tempbyte & 0x03) << 10);

    /* CSD byte 7 */
    tempbyte = (uint8_t)(sd_csd[1] & MMC_MASK_0_7BITS);
    pcardinfo->card_csd.c_size |= (uint32_t)((uint32_t)tempbyte << 2);

    /* CSD byte 8 */
    tempbyte = (uint8_t)((sd_csd[2] & MMC_MASK_24_31BITS) >> 24);
    pcardinfo->card_csd.c_size |= (uint32_t)((uint32_t)(tempbyte & 0xC0) >> 6);
    pcardinfo->card_csd.vdd_r_curr_min = (tempbyte & 0x38) >> 3;
    pcardinfo->card_csd.vdd_r_curr_max = tempbyte & 0x07;

    /* CSD byte 9 */
    tempbyte = (uint8_t)((sd_csd[2] & MMC_MASK_16_23BITS) >> 16);
    pcardinfo->card_csd.vdd_w_curr_min = (tempbyte & 0xE0) >> 5;
    pcardinfo->card_csd.vdd_w_curr_max = (tempbyte & 0x1C) >> 2;
    pcardinfo->card_csd.c_size_mult = (tempbyte & 0x03) << 1;

    /* CSD byte 10 */
    tempbyte = (uint8_t)((sd_csd[2] & MMC_MASK_8_15BITS) >> 8);
    pcardinfo->card_csd.c_size_mult |= (tempbyte & 0x80) >> 7;

    /* calculate the card block size and capacity */
    pcardinfo->card_blocksize = 1 << (pcardinfo->card_csd.read_bl_len);
    pcardinfo->card_capacity = pcardinfo->card_csd.c_size + 1;
    pcardinfo->card_capacity *= (1 << (pcardinfo->card_csd.c_size_mult + 2));
    pcardinfo->card_capacity *= pcardinfo->card_blocksize;

    pcardinfo->card_csd.erase_grp_size = (tempbyte & 0x7C) >> 2;
    pcardinfo->card_csd.erase_grp_mult = (tempbyte & 0x03) << 3;

    /* CSD byte 11 */
    tempbyte = (uint8_t)(sd_csd[2] & MMC_MASK_0_7BITS);

